# Используем официальный образ Go как базовый
FROM golang:1.20-alpine AS builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем go.mod и go.sum файлы в рабочую директорию
COPY go.mod go.sum ./

# Загружаем зависимости
RUN go mod tidy

# Копируем все остальные файлы проекта в рабочую директорию
COPY . .

# Собираем проект
RUN go build -o main .

# Используем более легкий образ для финального контейнера
FROM alpine:latest

# Устанавливаем рабочую директорию в контейнере
WORKDIR /root/

# Копируем собранный бинарник из builder контейнера
COPY --from=builder /app/main .

# Открываем порт, на котором будет работать приложение
EXPOSE 8080

# Команда для запуска приложения
CMD ["./main"]
